						|------------------>百度定义
						|------------------>同类技术有哪些
						|
						|1.是什么?--------->对比同类技术优缺点
								  |-------->组成部分	
										

						2.为什么出现?	解决什么问题?	
	学习新技术常用步骤;					没有这个技术前是怎么做的?
										
						
						
										1.快速上手视频
										2.官方示例
						怎么做?			3.写demo
										4.看开源代码
										5.项目实战	
										
										
						分享			博客	
									
									

1.百度定义;springCloud-->	
		Spring Cloud是一系列框架的有序集合。
它利用Spring Boot的开发便利性巧妙地简化了分布式系统基础设施的开发，如服务发现注册、配置中心、消息总线、
负载均衡、断路器、数据监控等，都可以用Spring Boot的开发风格做到一键启动和部署。Spring Cloud并没有重复制造轮子，
它只是将目前各家公司开发的比较成熟、经得起实际考验的服务框架组合起来，通过Spring Boot风格进行再封装屏蔽掉了复
杂的配置和实现原理，最终给开发者留出了一套简单易懂、易部署和易维护的分布式系统开发工具包。


2.springCloud--同类技术有哪些?
									